In [2]:
import numpy as np
import pandas as pd

In [4]:
from numpy.random import randn

In [6]:
np.random.seed(101)

In [8]:
df= pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [10]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [16]:
df['new']=df['W']+df['Z']

In [18]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [22]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df.shape

(5, 5)

In [28]:
df.loc['A']

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    3.210676
Name: A, dtype: float64

In [30]:
df.iloc[2]

W     -2.018168
X      0.740122
Y      0.528813
Z     -0.589001
new   -2.607169
Name: C, dtype: float64

In [32]:
df.loc['B','Y']

-0.8480769834036315

In [34]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [37]:
df>0

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True   True
C  False   True   True  False  False
D   True  False  False   True   True
E   True   True   True   True   True

In [39]:
df[df>0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118       NaN       NaN  0.605965  1.257083
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [41]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [43]:
df[df['W']>0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [45]:
df[df['Z']<0]

          W         X         Y         Z       new
C -2.018168  0.740122  0.528813 -0.589001 -2.607169

In [47]:
resultdf = df[df['W']>0]

In [49]:
resultdf

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [51]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [61]:
boolser = df['W']>0
result=df[boolser]
my_cols=['Y','X']
result[my_cols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [63]:
result

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [69]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z       new
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [71]:
df.reset_index()

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  3.210676
1     B  0.651118 -0.319318 -0.848077  0.605965  1.257083
2     C -2.018168  0.740122  0.528813 -0.589001 -2.607169
3     D  0.188695 -0.758872 -0.933237  0.955057  1.143752
4     E  0.190794  1.978757  2.605967  0.683509  0.874303

In [73]:
newind = 'CA NY WY OR CO'.split()

In [75]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [77]:
df['States']=newind

In [79]:
df

          W         X         Y         Z       new States
A  2.706850  0.628133  0.907969  0.503826  3.210676     CA
B  0.651118 -0.319318 -0.848077  0.605965  1.257083     NY
C -2.018168  0.740122  0.528813 -0.589001 -2.607169     WY
D  0.188695 -0.758872 -0.933237  0.955057  1.143752     OR
E  0.190794  1.978757  2.605967  0.683509  0.874303     CO

In [81]:
df.set_index('States')

               W         X         Y         Z       new
States
CA      2.706850  0.628133  0.907969  0.503826  3.210676
NY      0.651118 -0.319318 -0.848077  0.605965  1.257083
WY     -2.018168  0.740122  0.528813 -0.589001 -2.607169
OR      0.188695 -0.758872 -0.933237  0.955057  1.143752
CO      0.190794  1.978757  2.605967  0.683509  0.874303